#+TITLE: FormulaPages

Formula pages is a project to develop high quality building blocks compatible with spreadsheets.

These building blocks are published on NPM for node and are compatible with tools like webpack or browserify.

The libarries are packaged as UMD modules but they will clutter global namespace if you don't bundle your code with webpack or similar.

The source code is mostly written in ES6 with the exception of the parser which is written in jison.

This project is very similar to [[https://github.com/sutoiku/formula.js/][formula.js]]; except that this project includes a compiler. 

Currently, the formula.js project has much more coverage and many of the function need to be ported.

  |---+----------------------+-----------+-------+---------+--------+-----+----------|
  |   | Category             | Completed | Total | % Coded | Github | NPM | CircleCI |
  |---+----------------------+-----------+-------+---------+--------+-----+----------|
  | # | Logical              |         9 |     9 |  100.0% |      9 |   9 |        1 |
  | # | Date and Time        |        17 |    23 |   74.0% |      0 |   0 |        0 |
  | # | Engineering          |         2 |    51 |    4.0% |      0 |   0 |        0 |
  | # | Financial            |         8 |    31 |   26.0% |      0 |   0 |        0 |
  | # | Information          |        22 |    23 |   96.0% |     11 |  11 |        0 |
  | # | Lookup and Reference |        12 |    12 |  100.0% |      3 |   3 |        0 |
  | # | Math                 |        44 |    69 |   64.0% |     11 |  11 |        0 |
  | # | Stats                |         5 |    54 |   10.0% |      0 |   0 |        0 |
  | # | Text                 |        24 |    29 |   83.0% |      0 |   0 |        0 |
  |---+----------------------+-----------+-------+---------+--------+-----+----------|
  | # | Total                |       115 |   218 |   53.0% |        |     |          |
  |---+----------------------+-----------+-------+---------+--------+-----+----------|
  #+TBLFM: @3$5='(concat (number-to-string (fceiling (* 100 (/ (string-to-number (concat $3 ".0")) (string-to-number $4))))) "%")::@4$5='(concat (number-to-string (fceiling (* 100 (/ (string-to-number (concat $3 ".0")) (string-to-number $4))))) "%")::@5$5='(concat (number-to-string (fceiling (* 100 (/ (string-to-number (concat $3 ".0")) (string-to-number $4))))) "%")::@6$5='(concat (number-to-string (fceiling (* 100 (/ (string-to-number (concat $3 ".0")) (string-to-number $4))))) "%")::@2$5='(concat (number-to-string (fceiling (* 100 (/ (string-to-number (concat $3 ".0")) (string-to-number $4))))) "%")::@7$5='(concat (number-to-string (fceiling (* 100 (/ (string-to-number (concat $3 ".0")) (string-to-number $4))))) "%")::@8$5='(concat (number-to-string (fceiling (* 100 (/ (string-to-number (concat $3 ".0")) (string-to-number $4))))) "%")::@9$5='(concat (number-to-string (fceiling (* 100 (/ (string-to-number (concat $3 ".0")) (string-to-number $4))))) "%")::@10$5='(concat (number-to-string (fceiling (* 100 (/ (string-to-number (concat $3 ".0")) (string-to-number $4))))) "%")::@11$3=vsum(@5..10)::@11$4=vsum(@5..10)::@11$5='(concat (number-to-string (fceiling (* 100 (/ (string-to-number (concat $3 ".0")) (string-to-number $4))))) "%")
